#pragma once
namespace GB2017 {

enum ErrorCheckStatus
{
    RIGHT = 0,
    Network_Set_Fail = 1,           //网络设置失败
    Center_Control_Fail = 2,        //中心控制失败
    ERROR51 = 0x51,                 //灯组控制表屏蔽或禁止属性设置有误
    ERROR52 = 0x52,                 //相位控制表屏蔽或禁止属性设置有误
    ERROR53 = 0x53,                 //相位阶段控制表屏蔽或禁止属性设置有误
    ERROR54 = 0x54,                 //相位获取、路权、开机获取以及开机失去路权的类型设置有误
    ERROR55 = 0x55,                 //相位最小绿大于最大绿1或最大绿2,或者最大绿1大于最大绿2
    ERROR56 = 0x56,                 //相位开机获取路权可能存在冲突
    ERROR57 = 0x57,                 //相位开机失去路权可能存在冲突
    ERROR58 = 0x58,                 //相位冲突设置中不应该包含自身
    ERROR59 = 0x59,                 //相位阶段包含相位存在冲突
    ERROR5A = 0x5A,                 //时段开始时间链的上阶段时间 >= 下一段时间  
    ERROR60 = 0x60,                 //灯组id有误
    ERROR61 = 0x61,                 //灯组类型有误
    ERROR62 = 0x62,                 //相位id有误
    ERROR63 = 0x63,                 //相位关联灯组不存在
    ERROR64 = 0x64,                 //相位阶段id有误
    ERROR65 = 0x65,                 //方案id有误
    ERROR66 = 0x66,                 //方案路口号有误
    ERROR67 = 0x67,                 //方案包含的相位阶段出现类型有误
    ERROR68 = 0x68,                 //方案周期时长与包含的相位阶段之和不相等
    ERROR69 = 0x69,                 //方案包含的相位阶段不存在
    ERROR6A = 0x6A,                 //相位阶段包含的相位不存在
    ERROR6B = 0x6B,                 //相位晚启动+失去路权+早结束之和大于相位阶段时长
    ERROR6C = 0x6C,                 //时段计划id有误
    ERROR6D = 0x6D,                 //时段计划路口号有误
    ERROR6E = 0x6E,                 //第一个时段不是00:00
    ERROR6F = 0x6F,                 //小时或者分钟设置有误
    ERROR70 = 0x70,                 //时段所对应的方案号为0
    ERROR71 = 0x71,                 //时段所对应的控制模式设置有误
    ERROR72 = 0x72,                 //时段设置的方案不存在
    ERROR73 = 0x73,                 //时段对应的路口号与所设置方案的路口号不一样
    ERROR74 = 0x74,                 //调度id有误
    ERROR75 = 0x75,                 //调度路口号有误
    ERROR76 = 0x76,                 //调度所关联的时段计划不存在
    ERROR77 = 0x77,                 //调度的路口号与关联的时段计划路口号不一样
    ERROR78 = 0x78,                 //基础信息的控制路口数量设置有误
};

} //endof namespace GB2017
